import elsas from "./images/elsas.jpg";
import elradad from "./images/abdoelradad.jpg";
import ayman from "./images/ayman.jpg";
import abmalek from "./images/abdelmalek.jpg";
import amrkhaled from "./images/amr khaled.jpg";
import nofal from "./images/nofal.jpg";
import gad from "./images/gad.jpg";
import elgamal from "./images/elgamal.jpg";
import elbadry from "./images/elbadry.jpg";
import fc25 from "./images/fc25.jpg";
import joker from "./images/joker.jpg";
import wolf from "./images/wolfteam.jpg";
import blood from "./images/blood.jpg";
import scroo from "./images/scroo.jpg";
import none from "./images/none.jpg";
import hegab from "./images/hegab.jpg";

import slider1 from "./images/slider1.jpg";
import slider2 from "./images/slider2.jpg";
import slider3 from "./images/slider3.jpg";
import slider4 from "./images/slider4.jpg";
import slider5 from "./images/slider5.jpg";
import slider6 from "./images/slider6.jpg";

export const links = [
  {
    id: 1,
    name: "الرئيسية",
    href: "#home",
    icon: "🏠",
  },
  {
    id: 2,
    name: "من نحن",
    href: "#about",
    icon: "🍕",
  },
  {
    id: 3,
    name: "الالعاب",
    href: "#games",
    icon: "🎮",
  },
  {
    id: 4,
    name: "الفعاليات",
    href: "#events",
    icon: "🎉",
  },
];

export const members = [
  {
    id: 1,
    name: "Abdelrahman Elradad",
    image: elradad,
    famous: "radainio / abdo 😎",
    age: "23",
    description:
      "عضو محنك قديم و من مؤسيسن مجموعة الفاجرين ثم الانتقال الى مجموعة الضبعاويه كعضو منتدب. ومن ابرز مهاراته الهيد شوت باستخدام (البيستول)",
    faculty: "كلية الحاسبات و المعلومات",
    job: "عاطل",
    militaty: "معفى",
    wolfteamRank: 1,
    fifaRank: 4,
    football: 4,
  },
  {
    id: 2,
    name: "Mostafa Alaa",
    image: elsas,
    famous: "Elsas 🙌",
    age: "23",
    description:
      "احد الاعضاء القدامى ويشتهر بتشجيعه لفريق المصرى البورسعيدى و لريال مدريد حاليا. يعرف عنه غرابة مواعيد وجباته خلال اليوم و ايضا عدم إجادة لعبة ولف تيم",
    faculty: "الكلية البترولية",
    job: "مندوب توصيل لدى طلبات",
    militaty: "",
    wolfteamRank: 3,
    fifaRank: 3,
    football: 2,
  },
  {
    id: 3,
    name: "Abdelrahman Gad",
    image: gad,
    famous: "Gadinio ✨",
    age: "23",
    description:
      " احد الاعضاء المستحدثين داخل المجموعة. يشتهر بكرهه الشديد لعمل باص فى كرة القدم و الاكتفاء بعمل لووب طوال المبارة او الوقوف كحارس مرمى",
    faculty: "كلية الهندسة",
    job: "مندوب توصيل لدى طلبات",
    militaty: "معفى",
    wolfteamRank: 9,
    fifaRank: 5,
    football: 6,
  },
  {
    id: 4,
    name: "Ahmed Hegab",
    image: hegab,
    famous: "El7ogb 🍔",
    age: "23",
    description:
      "من أقدم الاعضاء داخل المجموعة. يشتهر قديما ببعض التعويذات السحريه مثل شيكولاه التى كانت تضعف قوة الخصم بنسبة تصل الى (50%). يشتهر بلعب مركز الدفاع المهاجم فى بعض الاحيان و يعرف بتدخلاته العنيفة و القوية على الخصوم",
    faculty: "كلية التجارة",
    job: "مندوب توصيل لدى شركة الفهد",
    militaty: "معفى",
    wolfteamRank: 4,
    fifaRank: 2,
    football: 5,
  },
  {
    id: 5,
    name: "Mahmoud Ahmed",
    image: abmalek,
    famous: "Elking 👑/ 3bmalek 🌹",
    age: "23",
    description:
      "احد الاعضاء القدامى داخل المجموعة. يشتهر بالحناكه فى أى شىء. ومن الاماكن المفضلة لديه و دائما جالس هناك فى مدينة بورسعيد التاريخيه هو مكان الحجر التاريخى وهو من ابرز معالم مدينة بورسعيد",
    faculty: "كلية التجارة",
    job: "غامض",
    militaty: "معفى",
    wolfteamRank: 6,
    fifaRank: 6,
    football: 8,
  },
  {
    id: 6,
    name: "Ahmed Elbadry",
    image: elbadry,
    famous: "Madama / elbedro 🎉",
    age: "23",
    description:
      "احد الاعضاء القدامى داخل المجموعه واحد المستحدثين فى لعبة ولف تيم. لم يعاصر العصر الذهبى للعبة ويشتهر باستخدامه اسلحة غريبة داخل اللعبه كما يجيد لعبة فيفا (الاصدارات القديمه فقط)",
    faculty: "كلية الهندسة",
    job: "معيد فى كلية الهندسة",
    militaty: "هارب",
    wolfteamRank: 5,
    fifaRank: 1,
    football: 3,
  },
  {
    id: 7,
    name: "Ahmed Ayman",
    image: ayman,
    famous: "Elmon 💕",
    age: "23",
    description:
      "احد الاعضاء القدامى داخل المجموعة. يشتهر باصدار بعض الروائح الجميلة و المنعشه فى الاماكن الضيقة. يعرف عنه انه جيد جدا فى كرة القدم",
    faculty: "كلية الهندسة",
    job: "مندوب توصيل لدى شركة الفهد",
    militaty: "لابس",
    wolfteamRank: 2,
    fifaRank: 3,
    football: 1,
  },
  {
    id: 8,
    name: "Mohamed Elgamal",
    image: elgamal,
    famous: "Elgamol 🎶",
    age: "23",
    description:
      "احد الاعضاء القدامى فى المجموعة و يعتبر أهم شخصية فى المجموعة ومن أبرز الاعضاء. فهو مصدر للروائح العطرة و معروف عنه تدنى مستواه الرياضى و مركزه المفضل حارس مرمى وهمى. تمثل الشاورما السورى حوالى (77%) من اجمالى كتلة جسمه ومكان تواجده المفضل صالون الحلاقة",
    faculty: "كلية تكنولوبيا و اداة النظم",
    job: "مندوب توصيل لدى شركة الفهد",
    militaty: "لابس",
    wolfteamRank: 7,
    fifaRank: 7,
    football: 11,
  },
  {
    id: 9,
    name: "Seif Yasser",
    image: none,
    famous: "Seif 👏",
    age: "23",
    description:
      "احد الاعضاء القدامى داخل الجروب. يشتهر بشرب القهوة و التدخين التفاريحى",
    faculty: "كلية الهندسة",
    job: "عاطل",
    militaty: "لابس",
    wolfteamRank: 10,
    fifaRank: 10,
    football: 10,
  },
  {
    id: 10,
    name: "Amr Khaled",
    image: amrkhaled,
    famous: "Elmora 👀",
    age: "23",
    description:
      "احد الاعضاء المستحدثين داخل الجروب. يشتهر بالخروجات الغامضة و الغير مرصودة. يجيد اللعب كمصارع ثيران فى كرة القدم و يشتهر بشىء يدعى بالقنديل البزازى او القنديل الط",
    faculty: "كلية الحاسبات و المعلومات",
    job: "عاطل",
    militaty: "لابس",
    wolfteamRank: 8,
    fifaRank: 9,
    football: 6,
  },
  {
    id: 11,
    name: "Mohanad Nofal",
    image: nofal,
    famous: "Nofla 🤗",
    age: "23",
    description:
      "أحد الاعضاء القدامى داخل المجموعة. يشتهر بمركز حراسة المرمى او اللعب كأحد اسود قصر النيل فى كرة القدم. يعرف بالحنكه و الدهاء فى تشخيص الامراض و الكشف على المريض بمجرد النظر",
    faculty: "كلية الطب",
    job: "عاطل",
    militaty: "لابس",
    wolfteamRank: 11,
    fifaRank: 11,
    football: 8,
  },
];

export const games = [
  {
    id: 1,
    name: "Fifa 2025",
    image: fc25,
  },
  {
    id: 2,
    name: "Wolfteam",
    image: wolf,
  },
  {
    id: 3,
    name: "Scroo",
    image: scroo,
  },
  {
    id: 4,
    name: "Joker",
    image: joker,
  },
  {
    id: 5,
    name: "bloodstrike",
    image: blood,
  },
];

export const slider = {
  id: 1,
  images: [slider1, slider2, slider3, slider4, slider5, slider6],
  direction: "left",
};

/* 
من نحن

قديما منذ سنوات كان مجموعة من الاصدقاء ذاهبون لقضاء بعض الوقت فى مكان يدعى بورتو فى بورسعيد 
قبل الوصول الى المكان كان الجميع سعداء بوقتهم الى ان قال احد الاشخاص 
حد فيكم عارف الضبعه و المناصره و الجرابعة وهذه الاماكن النائية 
ومن هنا جاء الاسم الضبعاويه وذلك بسبب الشعور بأنا لسنا من سكان بورتو وانما نحن من سكان قرية الضبعه المتسللين الى بورتو



*/
